In [4]:
import pandas as pd
import numpy as np

In [6]:
data = np.random.randn(4,3)

In [7]:
data

array([[-0.39654378,  0.0242074 ,  0.0145444 ],
       [-2.09324804, -1.01646041, -2.34948181],
       [ 0.29318961, -0.27644122,  1.05972188],
       [-1.01656315,  1.65000224, -1.37631539]])

In [9]:
dataFrame = pd.DataFrame(data)

In [10]:
dataFrame

          0         1         2
0 -0.396544  0.024207  0.014544
1 -2.093248 -1.016460 -2.349482
2  0.293190 -0.276441  1.059722
3 -1.016563  1.650002 -1.376315

In [12]:
type(dataFrame[0])

pandas.core.series.Series

In [14]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"], columns = ["Maas","Yas","Calisma Saati"])

In [15]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [16]:
yeniDataFrame["Yas"]

Atil      0.024207
Zeynep   -1.016460
Atlas    -0.276441
Mehmet    1.650002
Name: Yas, dtype: float64

In [17]:
yeniDataFrame["Calisma Saati"]

Atil      0.014544
Zeynep   -2.349482
Atlas     1.059722
Mehmet   -1.376315
Name: Calisma Saati, dtype: float64

In [18]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -0.396544  0.024207
Zeynep -2.093248 -1.016460
Atlas   0.293190 -0.276441
Mehmet -1.016563  1.650002

In [20]:
yeniDataFrame.loc["Atlas"]

Maas             0.293190
Yas             -0.276441
Calisma Saati    1.059722
Name: Atlas, dtype: float64

In [19]:
yeniDataFrame.loc["Zeynep"]

Maas            -2.093248
Yas             -1.016460
Calisma Saati   -2.349482
Name: Zeynep, dtype: float64

In [21]:
yeniDataFrame.iloc[1]  #Zeynep in bilgileri

Maas            -2.093248
Yas             -1.016460
Calisma Saati   -2.349482
Name: Zeynep, dtype: float64

In [22]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [24]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [25]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.396544  0.024207       0.014544        0.048415
Zeynep -2.093248 -1.016460      -2.349482       -2.032921
Atlas   0.293190 -0.276441       1.059722       -0.552882
Mehmet -1.016563  1.650002      -1.376315        3.300004

In [27]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1)

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [28]:
yeniDataFrame.drop("Mehmet")

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.396544  0.024207       0.014544        0.048415
Zeynep -2.093248 -1.016460      -2.349482       -2.032921
Atlas   0.293190 -0.276441       1.059722       -0.552882

In [29]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.396544  0.024207       0.014544        0.048415
Zeynep -2.093248 -1.016460      -2.349482       -2.032921
Atlas   0.293190 -0.276441       1.059722       -0.552882
Mehmet -1.016563  1.650002      -1.376315        3.300004

In [30]:
yeniDataFrame.drop("Emeklilik Yasi",axis=1,inplace=True)

In [31]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [32]:
yeniDataFrame.loc["Atil"]["Maas"]

-0.3965437799547286

In [33]:
yeniDataFrame.loc["Atlas","Yas"]

-0.2764412178711316

In [35]:
booleanFrame = yeniDataFrame < 0

In [36]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil     True  False          False
Zeynep   True   True           True
Atlas   False   True          False
Mehmet   True  False           True

In [37]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [38]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil   -0.396544       NaN            NaN
Zeynep -2.093248 -1.016460      -2.349482
Atlas        NaN -0.276441            NaN
Mehmet -1.016563       NaN      -1.376315

In [39]:
yeniDataFrame[yeniDataFrame > 0]

           Maas       Yas  Calisma Saati
Atil        NaN  0.024207       0.014544
Zeynep      NaN       NaN            NaN
Atlas   0.29319       NaN       1.059722
Mehmet      NaN  1.650002            NaN

In [41]:
yeniDataFrame["Yas"] > 0

Atil       True
Zeynep    False
Atlas     False
Mehmet     True
Name: Yas, dtype: bool

In [42]:
yeniDataFrame[yeniDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Mehmet -1.016563  1.650002      -1.376315

# index degistirme

In [43]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil -0.396544  0.024207       0.014544
1  Zeynep -2.093248 -1.016460      -2.349482
2   Atlas  0.293190 -0.276441       1.059722
3  Mehmet -1.016563  1.650002      -1.376315

In [44]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.396544  0.024207       0.014544
Zeynep -2.093248 -1.016460      -2.349482
Atlas   0.293190 -0.276441       1.059722
Mehmet -1.016563  1.650002      -1.376315

In [45]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [46]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [47]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -0.396544  0.024207       0.014544         Ati
Zeynep -2.093248 -1.016460      -2.349482         Zey
Atlas   0.293190 -0.276441       1.059722         Atl
Mehmet -1.016563  1.650002      -1.376315         Meh

In [48]:
yeniDataFrame.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -0.396544  0.024207       0.014544
Zey         -2.093248 -1.016460      -2.349482
Atl          0.293190 -0.276441       1.059722
Meh         -1.016563  1.650002      -1.376315

In [49]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil   -0.396544  0.024207       0.014544         Ati
Zeynep -2.093248 -1.016460      -2.349482         Zey
Atlas   0.293190 -0.276441       1.059722         Atl
Mehmet -1.016563  1.650002      -1.376315         Meh

In [50]:
yeniDataFrame.set_index("Yeni Indeks",inplace = True)

In [51]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -0.396544  0.024207       0.014544
Zey         -2.093248 -1.016460      -2.349482
Atl          0.293190 -0.276441       1.059722
Meh         -1.016563  1.650002      -1.376315

In [52]:
yeniDataFrame.loc["Ati"]

Maas            -0.396544
Yas              0.024207
Calisma Saati    0.014544
Name: Ati, dtype: float64

In [53]:
ilkIndeksler = ["Simpson","Simpson","Simpson","SouthPark","SouthPark","SouthPark"]

In [54]:
icIndeksler = ["Homer","Merge","Bart","Carthman","Kenny","Kyle"]

In [55]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [56]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Merge'),
 ('Simpson', 'Bart'),
 ('SouthPark', 'Carthman'),
 ('SouthPark', 'Kenny'),
 ('SouthPark', 'Kyle')]

In [58]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [59]:
birlesmisIndeks

MultiIndex([(  'Simpson',    'Homer'),
            (  'Simpson',    'Merge'),
            (  'Simpson',     'Bart'),
            ('SouthPark', 'Carthman'),
            ('SouthPark',    'Kenny'),
            ('SouthPark',     'Kyle')],
           )

In [60]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [61]:
benimCizgiFilmListem =[[10,"A"],[20,"B"],[30,"C"],[35,"D"],[23,"E"],[19,"F"]]

In [62]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [64]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks, columns = ["Yas","Meslek"])

In [65]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson   Homer     10      A
          Merge     20      B
          Bart      30      C
SouthPark Carthman  35      D
          Kenny     23      E
          Kyle      19      F

In [67]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  10      A
Merge  20      B
Bart   30      C

In [69]:
cizgiFilmDataFrame.loc["SouthPark"].loc["Kenny"]

Yas       23
Meslek     E
Name: Kenny, dtype: object

In [70]:
cizgiFilmDataFrame.index.names = ["Film ad","sim"]

In [71]:
cizgiFilmDataFrame

                   Yas Meslek
Film ad  sim
Simpson   Homer     10      A
          Merge     20      B
          Bart      30      C
SouthPark Carthman  35      D
          Kenny     23      E
          Kyle      19      F